## shell脚本一天一练系列 -- Day37
<< 'COMMENT'
请查看如下几个数字的规律，并使用shell脚本输出后面的十个数字。
10 31 53 77 105 141 ......

找规律：
21  22   24   28  36 
  1    2    4   8
COMMENT

### ------- 分割线,以下为脚本正文 -------
#!/bin/bash
# author: aming  (微信:  lishiming2009)
# version: v1
# date: 2023-10-31

## 通过上面的数字，规律是
## 差的差是2的i次方

## 先定义x的值为第一个数字，y的值为第一个差
x=10
y=21

## 因为已经给出6个数字，还需要10个数字，一共需要循环16次
for i in `seq 0 15`
do 
    echo -n "$x  "
    ## 每次循环，x的值需要用旧的x值加上y的值
    x=$[$x+$y]
    ## z的值就是差的差
    z=$[2**$i]
    ## 每次循环，y的值需要用旧的y值加上z的值
    y=$[$y+$z]
done
echo
